artillery.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 20
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 1500
      rampTo: 50
      name: Ramp up load
    # - duration: 60
    #   arrivalRate: 5
    #   rampTo: 50
scenarios:
  - flow:
      - post:
          url: "/graphql"
          json:
            query: |
              {
                equipes(id: 52) {
                  resultados{
                    status {
                      status_id
                      descricao
                    }
                  }
                }
              }